Revit 2027 API
DividedSurface.GetTileReference Method
Get a reference to one of the tile surfaces associated with a given seed node.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Reference GetTileReference(
	GridNode gridNode,
	int tileIndex
)
Public Function GetTileReference (
	gridNode As GridNode,
	tileIndex As Integer
) As Reference
public:
Reference^ GetTileReference(
	GridNode gridNode,
	int tileIndex
)
member GetTileReference :
        gridNode : GridNode *
        tileIndex : int -> Reference
Parameters
gridNode GridNode
tileIndex Int32
An integer between 0 and T-1, where T is TilesPerSeedNode.
Return Value
Reference
A reference to a Face (surface). Returns null if the grid node is not a "seed node", or if the tile is omitted due to boundary conditions.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  Thrown if the grid node is outside of the range specified by NumberOfUGridlines and NumberOfVGridlines, or if tileIndex is outside the range [0, TilesPerSeedNode-1].
See Also
Reference
DividedSurface Class
Autodesk.Revit.DB Namespace